ogneyar/C_Study/MDR_c/MDR32F02FI/Toolchain/Файлы поддержки IDE IAR для МК 1986ВК025/Embedded Workbench/riscv/config/debugger/Milandr/MLDR187_rev2.svd
                <register>
                    <name>RTC_TAFCR</name>
                    <displayName>RTC_TAFCR</displayName>
                    <description>RTC_TAFCR description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EVNT_LEVEL_W[2]</name>
                            <description>EVNT_LEVEL_W[2] description. Rev2</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_LEVEL_W[1]</name>
                            <description>EVNT_LEVEL_W[1] description. Rev2</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_LEVEL_W[0]</name>
                            <description>EVNT_LEVEL_W[0] description. Rev2</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_FRONT_W[2]</name>
                            <description>EVNT_FRONT_W[2] description. Rev2</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_FRONT_W[1]</name>
                            <description>EVNT_FRONT_W[1] description. Rev2</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_FRONT_W[0]</name>
                            <description>EVNT_FRONT_W[0] description. Rev2</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPE_W3</name>
                            <description>TAMPE_W3 description. Rev2</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPE_W2</name>
                            <description>TAMPE_W2 description. Rev2</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPE_W1</name>
                            <description>TAMPE_W1 description. Rev2</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAKE_SLEEP</name>
                            <description>WAKE_SLEEP description. Rev2</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSINSEL[2]</name>
                            <description>TSINSEL[2] description. Rev2</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSINSEL[1]</name>
                            <description>TSINSEL[1] description. Rev2</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSINSEL[0]</name>
                            <description>TSINSEL[0] description. Rev2</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPINSEL[2]</name>
                            <description>TAMPINSEL[2] description. Rev2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPINSEL[1]</name>
                            <description>TAMPINSEL[1] description. Rev2</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPINSEL[0]</name>
                            <description>TAMPINSEL[0] description. Rev2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSIE</name>
                            <description>TSIE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSEEDGE[2]</name>
                            <description>TSEEDGE[2] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSEEDGE[1]</name>
                            <description>TSEEDGE[1] description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSEEDGE[0]</name>
                            <description>TSEEDGE[0] description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSE</name>
                            <description>TSE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPIE</name>
                            <description>TAMPIE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPTRG[2]</name>
                            <description>TAMPTRG[2] description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPTRG[1]</name>
                            <description>TAMPTRG[1] description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPTRG[0]</name>
                            <description>TAMPTRG[0] description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPE</name>
                            <description>TAMPE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
