ogneyar/C_Study/MDR_c/MDR32F02FI/Toolchain/Файлы поддержки IDE IAR для МК 1986ВК025/Embedded Workbench/riscv/config/debugger/Milandr/MLDR187_rev2.svd
                <register>
                    <name>F1WC</name>
                    <displayName>F1WC</displayName>
                    <description>F1WC description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WGAIN</name>
                            <description>F1WGAIN description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOS</name>
                            <description>F1WATTOS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1WATTP</name>
                    <displayName>F1WATTP</displayName>
                    <description>F1WATTP description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1WATTN</name>
                    <displayName>F1WATTN</displayName>
                    <description>F1WATTN description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1VC</name>
                    <displayName>F1VC</displayName>
                    <description>F1VC description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARGAIN</name>
                            <description>F1VARGAIN description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F1VAROS</name>
                            <description>F1VAROS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARP</name>
                    <displayName>F1VARP</displayName>
                    <description>F1VARP description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1VARN</name>
                    <displayName>F1VARN</displayName>
                    <description>F1VARN description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1AC</name>
                    <displayName>F1AC</displayName>
                    <description>F1AC description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAGAIN</name>
                            <description>F1VAGAIN description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F1VRMSOS</name>
                            <description>F1VRMSOS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VR</name>
                    <displayName>F1VR</displayName>
                    <description>F1VR description</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1MD0</name>
                    <displayName>F1MD0</displayName>
                    <description>F1MD0 description</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1PER_FREQ</name>
                            <description>F1PER_FREQ description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>21</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>V1GAIN</name>
                            <description>V1GAIN description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I1GAIN</name>
                            <description>I1GAIN description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1REACTS</name>
                            <description>F1REACTS description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1ACTS</name>
                            <description>F1ACTS description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1ISEL</name>
                            <description>F1ISEL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>F1VSEL</name>
                            <description>F1VSEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1MD1</name>
                    <displayName>F1MD1</displayName>
                    <description>F1MD1 description</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VPKLVL</name>
                            <description>F1VPKLVL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>F1IPKLVL</name>
                            <description>F1IPKLVL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1MD2</name>
                    <displayName>F1MD2</displayName>
                    <description>F1MD2 description</description>
                    <addressOffset>0x00000090</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1PHASE</name>
                            <description>F1PHASE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VPEAK</name>
                    <displayName>F1VPEAK</displayName>
                    <description>F1VPEAK description</description>
                    <addressOffset>0x00000094</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VPEAK</name>
                            <description>F1VPEAK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1IPEAK</name>
                    <displayName>F1IPEAK</displayName>
                    <description>F1IPEAK description</description>
                    <addressOffset>0x00000098</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1IPEAK</name>
                            <description>F1IPEAK description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VDAT</name>
                    <displayName>F1VDAT</displayName>
                    <description>F1VDAT description</description>
                    <addressOffset>0x0000009C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VDAT</name>
                            <description>F1VDAT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1IDAT</name>
                    <displayName>F1IDAT</displayName>
                    <description>F1IDAT description</description>
                    <addressOffset>0x000000A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1IDAT</name>
                            <description>F1IDAT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS</name>
                    <displayName>F1VRMS</displayName>
                    <description>F1VRMS description</description>
                    <addressOffset>0x000000A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VRMS</name>
                            <description>F1VRMS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS2</name>
                    <displayName>F1VRMS2</displayName>
                    <description>F1VRMS2 description</description>
                    <addressOffset>0x000000A8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1IRMS</name>
                    <displayName>F1IRMS</displayName>
                    <description>F1IRMS description</description>
                    <addressOffset>0x000000AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1IRMS</name>
                            <description>F1IRMS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1IRMS2</name>
                    <displayName>F1IRMS2</displayName>
                    <description>F1IRMS2 description</description>
                    <addressOffset>0x000000B0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1STAT</name>
                    <displayName>F1STAT</displayName>
                    <description>F1STAT description</description>
                    <addressOffset>0x000000B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAROVN</name>
                            <description>F1VAROVN description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOVN</name>
                            <description>F1WATTOVN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ZEROCRS</name>
                            <description>F1ZEROCRS description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VANLDFL</name>
                            <description>F1VANLDFL description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VARNLDFL</name>
                            <description>F1VARNLDFL description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VARSIGN</name>
                            <description>F1VARSIGN description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1APNLDFL</name>
                            <description>F1APNLDFL description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1APSIGN</name>
                            <description>F1APSIGN description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ZXTOF</name>
                            <description>F1ZXTOF description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VAOV</name>
                            <description>F1VAOV description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VAROVP</name>
                            <description>F1VAROVP description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOVP</name>
                            <description>F1WATTOVP description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1PEAKIF</name>
                            <description>F1PEAKIF description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1PEAKVF</name>
                            <description>F1PEAKVF description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1SAGF</name>
                            <description>F1SAGF description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_OVR</name>
                            <description>F1IF_OVR description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_FLL</name>
                            <description>F1IF_FLL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1IF_EMP</name>
                            <description>F1IF_EMP description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VF_OVR</name>
                            <description>F1VF_OVR description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VF_FLL</name>
                            <description>F1VF_FLL description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VF_EMP</name>
                            <description>F1VF_EMP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
